src/cfe/Ж/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФизическиеЛица</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Ж/Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГруппыДоступа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Ж/Catalogs/ПрофилиГруппДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПрофилиГруппДоступа</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Ж/CommonModules/Ж_ЗУП/Ext/Module.bsl
Функция ПолучитьEmail(Знач вхФизлицо) Экспорт
    Если
        Строка(ТипЗнч(вхФизлицо))       =   "Сотрудники"
    Тогда
        вхФизлицо                       =   вхФизлицо.ФизическоеЛицо;
    КонецЕсли;
    Запрос                              =   Новый Запрос("ВЫБРАТЬ
                                            |   ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
                                            |ИЗ
                                            |   Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                                            |ГДЕ
                                            |   ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ФизЛицо
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка = &Ссылка");
    Запрос.УстановитьПараметр("Ссылка"  , Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
    Запрос.УстановитьПараметр("ФизЛицо" , вхФизлицо);
    Запрос.УстановитьПараметр("Тип"     , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Результат                           =   Запрос.Выполнить();
    ВыборкаДетальныеЗаписи              =   Результат.Выбрать();
    Пока
        ВыборкаДетальныеЗаписи.Следующий()
    Цикл
        Возврат ВыборкаДетальныеЗаписи.АдресЭП;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

Функция ПолучитьФизлицоПоEmail(Знач email) Экспорт
    Запрос                              =   Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                                                         |  ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
                                                         |  ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
                                                         |ИЗ
                                                         |  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                                                         |ГДЕ
                                                         |  ФизическиеЛицаКонтактнаяИнформация.АдресЭП = &email
                                                         |  И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
                                                         |  И ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка = &EmailФизЛица
                                                         |
                                                         |УПОРЯДОЧИТЬ ПО
                                                         |  ФизическиеЛицаКонтактнаяИнформация.Ссылка.Код УБЫВ");
    Запрос.УстановитьПараметр("EmailФизЛица", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
    Запрос.УстановитьПараметр("email"       , email);
    Запрос.УстановитьПараметр("Тип"         , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Результат                           =   Запрос.Выполнить();
    ВыборкаДетальныеЗаписи              =   Результат.Выбрать();
    Пока
        ВыборкаДетальныеЗаписи.Следующий()
    Цикл
        Возврат ВыборкаДетальныеЗаписи.Ссылка;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

Функция СписокПользователейПоРолиЧерезГруппыДоступа(НазваниеРоли) Экспорт
    Запрос                              =   Новый Запрос("ВЫБРАТЬ
                                                         |  ГруппыДоступа.Пользователь КАК Пользователь
                                                         |ИЗ
                                                         |  Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступа
                                                         |ГДЕ
                                                         |  ГруппыДоступа.Ссылка.Профиль В
                                                         |          (ВЫБРАТЬ
                                                         |              ПрофилиГруппДоступаРоли.Ссылка КАК Ссылка
                                                         |          ИЗ
                                                         |              Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
                                                         |          ГДЕ
                                                         |              ПрофилиГруппДоступаРоли.Роль.Наименование = &Наименование
                                                         |          ИЛИ ПрофилиГруппДоступаРоли.Роль.Имя = &Наименование)");
    Запрос.УстановитьПараметр("Наименование", НазваниеРоли);
    Возврат Запрос.Выполнить().Выбрать();
КонецФункции
